---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitSequence
source: html/174553d3-a7c0-e253-5e36-19a5c57f0132.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitSequence Property

The sequence in which power circuits are created.

## Syntax (C#)
```csharp
public CircuitSequence CircuitSequence { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration